{"config": [{"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_constraint": null, "implementation": 1, "trainable": true, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "dropout": 0.0, "recurrent_constraint": null, "batch_input_shape": [null, 4, 2], "name": "lstm_1", "recurrent_regularizer": null, "return_sequences": true, "dtype": "float32", "bias_regularizer": null, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "activation": "tanh", "kernel_constraint": null, "kernel_regularizer": null, "units": 128}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_constraint": null, "implementation": 1, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "dropout": 0.0, "recurrent_constraint": null, "name": "lstm_2", "recurrent_regularizer": null, "return_sequences": true, "bias_regularizer": null, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 64}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_constraint": null, "implementation": 1, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "dropout": 0.0, "recurrent_constraint": null, "name": "lstm_3", "recurrent_regularizer": null, "return_sequences": false, "bias_regularizer": null, "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "unroll": false, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 32}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": {"config": {}, "class_name": "NonNeg"}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "activation": "linear", "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow"}